-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: db
-- Generation Time: Jan 11, 2026 at 03:10 AM
-- Server version: 11.8.5-MariaDB-ubu2404
-- PHP Version: 8.3.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `shift_scheduler`
--
CREATE DATABASE IF NOT EXISTS `shift_scheduler` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_uca1400_ai_ci;
USE `shift_scheduler`;

-- --------------------------------------------------------

--
-- Table structure for table `schedules`
--

CREATE TABLE `schedules` (
  `id` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `date` date NOT NULL,
  `day_name` varchar(20) DEFAULT NULL,
  `tp_a_id` int(11) DEFAULT NULL,
  `tp_b_id` int(11) DEFAULT NULL,
  `rs_id` int(11) DEFAULT NULL,
  `rs_morning_id` int(11) DEFAULT NULL,
  `rs_afternoon_id` int(11) DEFAULT NULL,
  `is_working` tinyint(1) DEFAULT 0,
  `is_weekend` tinyint(1) DEFAULT 0,
  `is_holiday` tinyint(1) DEFAULT 0,
  `holiday_name` varchar(200) DEFAULT NULL,
  `remark` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `schedules`
--

INSERT INTO `schedules` (`id`, `year`, `date`, `day_name`, `tp_a_id`, `tp_b_id`, `rs_id`, `rs_morning_id`, `rs_afternoon_id`, `is_working`, `is_weekend`, `is_holiday`, `holiday_name`, `remark`, `created_at`) VALUES
(4016, 2026, '2026-01-01', 'พฤหัสบดี', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันขึ้นปีใหม่', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4017, 2026, '2026-01-02', 'ศุกร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันหยุดพิเศษ (ชดเชยวันขึ้นปีใหม่)', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4018, 2026, '2026-01-03', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4019, 2026, '2026-01-04', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4020, 2026, '2026-01-05', 'จันทร์', 1, 11, NULL, 12, 13, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B3', '2025-12-25 09:25:28'),
(4021, 2026, '2026-01-06', 'อังคาร', 10, 20, NULL, 17, 15, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B5', '2025-12-25 09:25:28'),
(4022, 2026, '2026-01-07', 'พุธ', 2, 21, NULL, 18, 11, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: B1', '2025-12-25 09:25:28'),
(4023, 2026, '2026-01-08', 'พฤหัสบดี', 3, 23, NULL, 20, 25, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B15', '2025-12-25 09:25:28'),
(4024, 2026, '2026-01-09', 'ศุกร์', 5, 24, NULL, 21, 16, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B6', '2025-12-25 09:25:28'),
(4025, 2026, '2026-01-10', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4026, 2026, '2026-01-11', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4027, 2026, '2026-01-12', 'จันทร์', 6, 25, NULL, 23, 14, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B4', '2025-12-25 09:25:28'),
(4028, 2026, '2026-01-13', 'อังคาร', 7, 12, NULL, 24, 19, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B9', '2025-12-25 09:25:28'),
(4029, 2026, '2026-01-14', 'พุธ', 10, 13, NULL, 15, 17, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B7', '2025-12-25 09:25:28'),
(4030, 2026, '2026-01-15', 'พฤหัสบดี', 2, 14, NULL, 12, 18, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B8', '2025-12-25 09:25:28'),
(4031, 2026, '2026-01-16', 'ศุกร์', 6, 15, NULL, 13, 21, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B11', '2025-12-25 09:25:28'),
(4032, 2026, '2026-01-17', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4033, 2026, '2026-01-18', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4034, 2026, '2026-01-19', 'จันทร์', 5, 16, NULL, 11, 20, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B10', '2025-12-25 09:25:28'),
(4035, 2026, '2026-01-20', 'อังคาร', 4, 17, NULL, 14, 23, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B13', '2025-12-25 09:25:28'),
(4036, 2026, '2026-01-21', 'พุธ', 8, 18, NULL, 16, 24, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B14', '2025-12-25 09:25:28'),
(4037, 2026, '2026-01-22', 'พฤหัสบดี', 9, 19, NULL, 25, 12, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B2', '2025-12-25 09:25:28'),
(4038, 2026, '2026-01-23', 'ศุกร์', 1, 11, NULL, 17, 13, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B3', '2025-12-25 09:25:28'),
(4039, 2026, '2026-01-24', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4040, 2026, '2026-01-25', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4041, 2026, '2026-01-26', 'จันทร์', 3, 20, NULL, 19, 15, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B5', '2025-12-25 09:25:28'),
(4042, 2026, '2026-01-27', 'อังคาร', 8, 21, NULL, 18, 11, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: B1', '2025-12-25 09:25:28'),
(4043, 2026, '2026-01-28', 'พุธ', 4, 23, NULL, 13, 14, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B4', '2025-12-25 09:25:28'),
(4044, 2026, '2026-01-29', 'พฤหัสบดี', 7, 24, NULL, 21, 16, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B6', '2025-12-25 09:25:28'),
(4045, 2026, '2026-01-30', 'ศุกร์', 9, 25, NULL, 20, 17, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B7', '2025-12-25 09:25:28'),
(4046, 2026, '2026-01-31', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4047, 2026, '2026-02-01', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4048, 2026, '2026-02-02', 'จันทร์', 10, 12, NULL, 23, 24, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B14', '2025-12-25 09:25:28'),
(4049, 2026, '2026-02-03', 'อังคาร', 1, 13, NULL, 19, 25, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B15', '2025-12-25 09:25:28'),
(4050, 2026, '2026-02-04', 'พุธ', 3, 14, NULL, 12, 18, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B8', '2025-12-25 09:25:28'),
(4051, 2026, '2026-02-05', 'พฤหัสบดี', 4, 15, NULL, 11, 21, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B11', '2025-12-25 09:25:28'),
(4052, 2026, '2026-02-06', 'ศุกร์', 2, 16, NULL, 14, 20, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B10', '2025-12-25 09:25:28'),
(4053, 2026, '2026-02-07', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4054, 2026, '2026-02-08', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4055, 2026, '2026-02-09', 'จันทร์', 7, 22, NULL, 15, 12, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B2', '2025-12-25 09:25:28'),
(4056, 2026, '2026-02-10', 'อังคาร', 5, 18, NULL, 16, 23, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B13', '2025-12-25 09:25:28'),
(4057, 2026, '2026-02-11', 'พุธ', 6, 17, NULL, 22, 13, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B3', '2025-12-25 09:25:28'),
(4058, 2026, '2026-02-12', 'พฤหัสบดี', 8, 19, NULL, 24, 15, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B5', '2025-12-25 09:25:28'),
(4059, 2026, '2026-02-13', 'ศุกร์', 9, 20, NULL, 22, 17, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B7', '2025-12-25 09:25:28'),
(4060, 2026, '2026-02-14', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4061, 2026, '2026-02-15', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4062, 2026, '2026-02-16', 'จันทร์', 2, 21, NULL, 25, 19, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B9', '2025-12-25 09:25:28'),
(4063, 2026, '2026-02-17', 'อังคาร', 3, 11, NULL, 22, 18, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B8', '2025-12-25 09:25:28'),
(4064, 2026, '2026-02-18', 'พุธ', 1, 24, NULL, 13, 14, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B4', '2025-12-25 09:25:28'),
(4065, 2026, '2026-02-19', 'พฤหัสบดี', 10, 25, NULL, 22, 11, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B1', '2025-12-25 09:25:28'),
(4066, 2026, '2026-02-20', 'ศุกร์', 4, 23, NULL, 16, 20, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B10', '2025-12-25 09:25:28'),
(4067, 2026, '2026-02-21', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4068, 2026, '2026-02-22', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4069, 2026, '2026-02-23', 'จันทร์', 8, 22, NULL, 17, 21, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B11', '2025-12-25 09:25:28'),
(4070, 2026, '2026-02-24', 'อังคาร', 6, 14, NULL, 24, 19, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B9', '2025-12-25 09:25:28'),
(4071, 2026, '2026-02-25', 'พุธ', 5, 12, NULL, 22, 23, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B13', '2025-12-25 09:25:28'),
(4072, 2026, '2026-02-26', 'พฤหัสบดี', 7, 13, NULL, 15, 25, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B15', '2025-12-25 09:25:28'),
(4073, 2026, '2026-02-27', 'ศุกร์', 9, 17, NULL, 18, 22, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: B12', '2025-12-25 09:25:28'),
(4074, 2026, '2026-02-28', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4075, 2026, '2026-03-01', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4076, 2026, '2026-03-02', 'จันทร์', 4, 15, NULL, 12, 2, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: A2', '2025-12-25 09:25:28'),
(4077, 2026, '2026-03-03', 'อังคาร', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันมาฆบูชา', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4078, 2026, '2026-03-04', 'พุธ', NULL, NULL, NULL, 5, 6, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A6', '2025-12-25 09:25:28'),
(4079, 2026, '2026-03-05', 'พฤหัสบดี', 1, 16, NULL, 3, 8, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: A8', '2025-12-25 09:25:28'),
(4080, 2026, '2026-03-06', 'ศุกร์', NULL, NULL, NULL, 7, 22, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: B12', '2025-12-25 09:25:28'),
(4081, 2026, '2026-03-07', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4082, 2026, '2026-03-08', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4083, 2026, '2026-03-09', 'จันทร์', 10, 18, NULL, 14, 16, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B6', '2025-12-25 09:25:28'),
(4084, 2026, '2026-03-10', 'อังคาร', 2, 22, NULL, 11, 24, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B14', '2025-12-25 09:25:28'),
(4085, 2026, '2026-03-11', 'พุธ', NULL, NULL, NULL, 20, 12, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B2', '2025-12-25 09:25:28'),
(4086, 2026, '2026-03-12', 'พฤหัสบดี', 5, 19, NULL, 23, 13, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B3', '2025-12-25 09:25:28'),
(4087, 2026, '2026-03-13', 'ศุกร์', NULL, NULL, NULL, 21, 17, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B7', '2025-12-25 09:25:28'),
(4088, 2026, '2026-03-14', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4089, 2026, '2026-03-15', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4090, 2026, '2026-03-16', 'จันทร์', 3, 23, NULL, 25, 15, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B5', '2025-12-25 09:25:28'),
(4091, 2026, '2026-03-17', 'อังคาร', 6, 24, NULL, 19, 18, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B8', '2025-12-25 09:25:28'),
(4092, 2026, '2026-03-18', 'พุธ', NULL, NULL, NULL, 9, 1, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A1', '2025-12-25 09:25:28'),
(4093, 2026, '2026-03-19', 'พฤหัสบดี', 8, 11, NULL, 4, 5, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: A5', '2025-12-25 09:25:28'),
(4094, 2026, '2026-03-20', 'ศุกร์', NULL, NULL, NULL, 6, 3, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: A3', '2025-12-25 09:25:28'),
(4095, 2026, '2026-03-21', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4096, 2026, '2026-03-22', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4097, 2026, '2026-03-23', 'จันทร์', 7, 13, NULL, 10, 2, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: A2', '2025-12-25 09:25:28'),
(4098, 2026, '2026-03-24', 'อังคาร', 9, 25, NULL, 8, 22, 1, 0, 0, NULL, ' | เช้า: A8, บ่าย: B12', '2025-12-25 09:25:28'),
(4099, 2026, '2026-03-25', 'พุธ', NULL, NULL, NULL, 7, 16, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: B6', '2025-12-25 09:25:28'),
(4100, 2026, '2026-03-26', 'พฤหัสบดี', 6, 20, NULL, 13, 14, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B4', '2025-12-25 09:25:28'),
(4101, 2026, '2026-03-27', 'ศุกร์', NULL, NULL, NULL, 11, 21, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B11', '2025-12-25 09:25:28'),
(4102, 2026, '2026-03-28', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4103, 2026, '2026-03-29', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4104, 2026, '2026-03-30', 'จันทร์', 1, 14, NULL, 20, 23, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B13', '2025-12-25 09:25:28'),
(4105, 2026, '2026-03-31', 'อังคาร', 2, 21, NULL, 17, 25, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B15', '2025-12-25 09:25:28'),
(4106, 2026, '2026-04-01', 'พุธ', NULL, NULL, NULL, 19, 24, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B14', '2025-12-25 09:25:28'),
(4107, 2026, '2026-04-02', 'พฤหัสบดี', 4, 12, NULL, 15, 18, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B8', '2025-12-25 09:25:28'),
(4108, 2026, '2026-04-03', 'ศุกร์', NULL, NULL, NULL, 1, 9, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: A9', '2025-12-25 09:25:28'),
(4109, 2026, '2026-04-04', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4110, 2026, '2026-04-05', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4111, 2026, '2026-04-06', 'จันทร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันจักรี', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:28'),
(4112, 2026, '2026-04-07', 'อังคาร', 5, 15, NULL, 12, 4, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: A4', '2025-12-25 09:25:28'),
(4113, 2026, '2026-04-08', 'พุธ', NULL, NULL, NULL, 2, 7, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: A7', '2025-12-25 09:25:28'),
(4114, 2026, '2026-04-09', 'พฤหัสบดี', 10, 17, NULL, 6, 3, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: A3', '2025-12-25 09:25:29'),
(4115, 2026, '2026-04-10', 'ศุกร์', NULL, NULL, NULL, 5, 8, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A8', '2025-12-25 09:25:29'),
(4116, 2026, '2026-04-11', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4117, 2026, '2026-04-12', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4118, 2026, '2026-04-13', 'จันทร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันสงกรานต์', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4119, 2026, '2026-04-14', 'อังคาร', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันสงกรานต์', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4120, 2026, '2026-04-15', 'พุธ', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันสงกรานต์', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4121, 2026, '2026-04-16', 'พฤหัสบดี', 3, 18, NULL, 10, 20, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: B10', '2025-12-25 09:25:29'),
(4122, 2026, '2026-04-17', 'ศุกร์', NULL, NULL, NULL, 14, 11, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B1', '2025-12-25 09:25:29'),
(4123, 2026, '2026-04-18', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4124, 2026, '2026-04-19', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4125, 2026, '2026-04-20', 'จันทร์', 8, 16, NULL, 21, 19, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B9', '2025-12-25 09:25:29'),
(4126, 2026, '2026-04-21', 'อังคาร', 7, 22, NULL, 23, 12, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B2', '2025-12-25 09:25:29'),
(4127, 2026, '2026-04-22', 'พุธ', NULL, NULL, NULL, 16, 13, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B3', '2025-12-25 09:25:29'),
(4128, 2026, '2026-04-23', 'พฤหัสบดี', 9, 19, NULL, 24, 22, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B12', '2025-12-25 09:25:29'),
(4129, 2026, '2026-04-24', 'ศุกร์', NULL, NULL, NULL, 25, 17, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B7', '2025-12-25 09:25:29'),
(4130, 2026, '2026-04-25', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4131, 2026, '2026-04-26', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4132, 2026, '2026-04-27', 'จันทร์', 2, 24, NULL, 18, 15, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: B5', '2025-12-25 09:25:29'),
(4133, 2026, '2026-04-28', 'อังคาร', 1, 23, NULL, 9, 10, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A10', '2025-12-25 09:25:29'),
(4134, 2026, '2026-04-29', 'พุธ', NULL, NULL, NULL, 2, 5, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: A5', '2025-12-25 09:25:29'),
(4135, 2026, '2026-04-30', 'พฤหัสบดี', 6, 21, NULL, 1, 4, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: A4', '2025-12-25 09:25:29'),
(4136, 2026, '2026-05-01', 'ศุกร์', NULL, NULL, NULL, 8, 7, 1, 0, 0, NULL, 'วันแรงงานแห่งชาติ (จัดเวรปกติ) |  | เช้า: A8, บ่าย: A7', '2025-12-25 09:25:29'),
(4137, 2026, '2026-05-02', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4138, 2026, '2026-05-03', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4139, 2026, '2026-05-04', 'จันทร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันฉัตรมงคล', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4140, 2026, '2026-05-05', 'อังคาร', 4, 16, NULL, 3, 6, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: A6', '2025-12-25 09:25:29'),
(4141, 2026, '2026-05-06', 'พุธ', NULL, NULL, NULL, 14, 11, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B1', '2025-12-25 09:25:29'),
(4142, 2026, '2026-05-07', 'พฤหัสบดี', 5, 22, NULL, 16, 20, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B10', '2025-12-25 09:25:29'),
(4143, 2026, '2026-05-08', 'ศุกร์', NULL, NULL, NULL, 13, 21, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B11', '2025-12-25 09:25:29'),
(4144, 2026, '2026-05-09', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4145, 2026, '2026-05-10', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4146, 2026, '2026-05-11', 'จันทร์', 9, 17, NULL, 23, 22, 1, 0, 0, NULL, 'วันพืชมงคล (รอประกาศยืนยันจากราชการ, จัดเวรปกติไปก่อน) |  | เช้า: B13, บ่าย: B12', '2025-12-25 09:25:29'),
(4147, 2026, '2026-05-12', 'อังคาร', 10, 11, NULL, 19, 12, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B2', '2025-12-25 09:25:29'),
(4148, 2026, '2026-05-13', 'พุธ', NULL, NULL, NULL, 17, 25, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B15', '2025-12-25 09:25:29'),
(4149, 2026, '2026-05-14', 'พฤหัสบดี', 3, 20, NULL, 24, 15, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B5', '2025-12-25 09:25:29'),
(4150, 2026, '2026-05-15', 'ศุกร์', NULL, NULL, NULL, 18, 9, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: A9', '2025-12-25 09:25:29'),
(4151, 2026, '2026-05-16', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4152, 2026, '2026-05-17', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4153, 2026, '2026-05-18', 'จันทร์', 7, 25, NULL, 4, 1, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: A1', '2025-12-25 09:25:29'),
(4154, 2026, '2026-05-19', 'อังคาร', 8, 12, NULL, 5, 10, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A10', '2025-12-25 09:25:29'),
(4155, 2026, '2026-05-20', 'พุธ', NULL, NULL, NULL, 6, 7, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: A7', '2025-12-25 09:25:29'),
(4156, 2026, '2026-05-21', 'พฤหัสบดี', 1, 13, NULL, 2, 8, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: A8', '2025-12-25 09:25:29'),
(4157, 2026, '2026-05-22', 'ศุกร์', NULL, NULL, NULL, 3, 16, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: B6', '2025-12-25 09:25:29'),
(4158, 2026, '2026-05-23', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4159, 2026, '2026-05-24', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4160, 2026, '2026-05-25', 'จันทร์', 6, 14, NULL, 11, 24, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B14', '2025-12-25 09:25:29'),
(4161, 2026, '2026-05-26', 'อังคาร', 2, 15, NULL, 20, 23, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B13', '2025-12-25 09:25:29'),
(4162, 2026, '2026-05-27', 'พุธ', NULL, NULL, NULL, 21, 14, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B4', '2025-12-25 09:25:29'),
(4163, 2026, '2026-05-28', 'พฤหัสบดี', 4, 18, NULL, 25, 19, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B9', '2025-12-25 09:25:29'),
(4164, 2026, '2026-05-29', 'ศุกร์', NULL, NULL, NULL, 15, 13, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B3', '2025-12-25 09:25:29'),
(4165, 2026, '2026-05-30', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4166, 2026, '2026-05-31', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4167, 2026, '2026-06-01', 'จันทร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันหยุดชดเชยวิสาขบูชา', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4168, 2026, '2026-06-02', 'อังคาร', 5, 19, NULL, 17, 22, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B12', '2025-12-25 09:25:29'),
(4169, 2026, '2026-06-03', 'พุธ', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันเฉลิมพระชนมพรรษา พระบรมราชินี', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4170, 2026, '2026-06-04', 'พฤหัสบดี', 10, 23, NULL, 12, 18, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B8', '2025-12-25 09:25:29'),
(4171, 2026, '2026-06-05', 'ศุกร์', NULL, NULL, NULL, 7, 2, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: A2', '2025-12-25 09:25:29'),
(4172, 2026, '2026-06-06', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4173, 2026, '2026-06-07', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4174, 2026, '2026-06-08', 'จันทร์', 9, 24, NULL, 1, 5, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: A5', '2025-12-25 09:25:29'),
(4175, 2026, '2026-06-09', 'อังคาร', 3, 17, NULL, 8, 6, 1, 0, 0, NULL, ' | เช้า: A8, บ่าย: A6', '2025-12-25 09:25:29'),
(4176, 2026, '2026-06-10', 'พุธ', NULL, NULL, NULL, 9, 4, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A4', '2025-12-25 09:25:29'),
(4177, 2026, '2026-06-11', 'พฤหัสบดี', 7, 11, NULL, 10, 3, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: A3', '2025-12-25 09:25:29'),
(4178, 2026, '2026-06-12', 'ศุกร์', NULL, NULL, NULL, 14, 16, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B6', '2025-12-25 09:25:29'),
(4179, 2026, '2026-06-13', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4180, 2026, '2026-06-14', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4181, 2026, '2026-06-15', 'จันทร์', 8, 20, NULL, 13, 11, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B1', '2025-12-25 09:25:29'),
(4182, 2026, '2026-06-16', 'อังคาร', 1, 25, NULL, 21, 17, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B7', '2025-12-25 09:25:29'),
(4183, 2026, '2026-06-17', 'พุธ', NULL, NULL, NULL, 20, 23, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B13', '2025-12-25 09:25:29'),
(4184, 2026, '2026-06-18', 'พฤหัสบดี', 2, 21, NULL, 19, 24, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B14', '2025-12-25 09:25:29'),
(4185, 2026, '2026-06-19', 'ศุกร์', NULL, NULL, NULL, 25, 22, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B12', '2025-12-25 09:25:29'),
(4186, 2026, '2026-06-20', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4187, 2026, '2026-06-21', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4188, 2026, '2026-06-22', 'จันทร์', 4, 12, NULL, 15, 18, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B8', '2025-12-25 09:25:29'),
(4189, 2026, '2026-06-23', 'อังคาร', 6, 13, NULL, 9, 1, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A1', '2025-12-25 09:25:29'),
(4190, 2026, '2026-06-24', 'พุธ', NULL, NULL, NULL, 12, 10, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: A10', '2025-12-25 09:25:29'),
(4191, 2026, '2026-06-25', 'พฤหัสบดี', 5, 22, NULL, 4, 7, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: A7', '2025-12-25 09:25:29'),
(4192, 2026, '2026-06-26', 'ศุกร์', NULL, NULL, NULL, 2, 6, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: A6', '2025-12-25 09:25:29'),
(4193, 2026, '2026-06-27', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4194, 2026, '2026-06-28', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4195, 2026, '2026-06-29', 'จันทร์', 10, 15, NULL, 5, 8, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A8', '2025-12-25 09:25:29'),
(4196, 2026, '2026-06-30', 'อังคาร', 9, 14, NULL, 3, 20, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: B10', '2025-12-25 09:25:29'),
(4197, 2026, '2026-07-01', 'พุธ', 7, 16, NULL, 11, 21, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B11', '2025-12-25 09:25:29'),
(4198, 2026, '2026-07-02', 'พฤหัสบดี', 8, 18, NULL, 23, 14, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B4', '2025-12-25 09:25:29'),
(4199, 2026, '2026-07-03', 'ศุกร์', 3, 19, NULL, 16, 12, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B2', '2025-12-25 09:25:29'),
(4200, 2026, '2026-07-04', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4201, 2026, '2026-07-05', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4202, 2026, '2026-07-06', 'จันทร์', 5, 23, NULL, 22, 25, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B15', '2025-12-25 09:25:29'),
(4203, 2026, '2026-07-07', 'อังคาร', 4, 24, NULL, 18, 19, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: B9', '2025-12-25 09:25:29'),
(4204, 2026, '2026-07-08', 'พุธ', 9, 11, NULL, 13, 15, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B5', '2025-12-25 09:25:29'),
(4205, 2026, '2026-07-09', 'พฤหัสบดี', 1, 17, NULL, 24, 2, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: A2', '2025-12-25 09:25:29'),
(4206, 2026, '2026-07-10', 'ศุกร์', 10, 21, NULL, 7, 9, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: A9', '2025-12-25 09:25:29'),
(4207, 2026, '2026-07-11', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4208, 2026, '2026-07-12', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4209, 2026, '2026-07-13', 'จันทร์', 2, 13, NULL, 17, 5, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: A5', '2025-12-25 09:25:29'),
(4210, 2026, '2026-07-14', 'อังคาร', 6, 20, NULL, 1, 4, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: A4', '2025-12-25 09:25:29'),
(4211, 2026, '2026-07-15', 'พุธ', 3, 25, NULL, 8, 10, 1, 0, 0, NULL, ' | เช้า: A8, บ่าย: A10', '2025-12-25 09:25:29'),
(4212, 2026, '2026-07-16', 'พฤหัสบดี', 7, 12, NULL, 6, 11, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: B1', '2025-12-25 09:25:29'),
(4213, 2026, '2026-07-17', 'ศุกร์', 8, 14, NULL, 3, 20, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: B10', '2025-12-25 09:25:29'),
(4214, 2026, '2026-07-18', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4215, 2026, '2026-07-19', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4216, 2026, '2026-07-20', 'จันทร์', 1, 22, NULL, 21, 16, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B6', '2025-12-25 09:25:29'),
(4217, 2026, '2026-07-21', 'อังคาร', 10, 15, NULL, 14, 13, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B3', '2025-12-25 09:25:29'),
(4218, 2026, '2026-07-22', 'พุธ', 9, 16, NULL, 25, 12, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B2', '2025-12-25 09:25:29'),
(4219, 2026, '2026-07-23', 'พฤหัสบดี', 2, 18, NULL, 23, 17, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B7', '2025-12-25 09:25:29'),
(4220, 2026, '2026-07-24', 'ศุกร์', 4, 19, NULL, 22, 24, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B14', '2025-12-25 09:25:29'),
(4221, 2026, '2026-07-25', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4222, 2026, '2026-07-26', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4223, 2026, '2026-07-27', 'จันทร์', 5, 11, NULL, 15, 18, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B8', '2025-12-25 09:25:29'),
(4224, 2026, '2026-07-28', 'อังคาร', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันเฉลิมพระชนมพรรษา ร.10', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4225, 2026, '2026-07-29', 'พุธ', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันอาสาฬหบูชา', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4226, 2026, '2026-07-30', 'พฤหัสบดี', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันเข้าพรรษา', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4227, 2026, '2026-07-31', 'ศุกร์', 6, 12, NULL, 19, 9, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: A9', '2025-12-25 09:25:29'),
(4228, 2026, '2026-08-01', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4229, 2026, '2026-08-02', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4230, 2026, '2026-08-03', 'จันทร์', 3, 21, NULL, 4, 1, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: A1', '2025-12-25 09:25:29'),
(4231, 2026, '2026-08-04', 'อังคาร', 8, 23, NULL, 10, 2, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: A2', '2025-12-25 09:25:29'),
(4232, 2026, '2026-08-05', 'พุธ', 7, 20, NULL, 6, 3, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: A3', '2025-12-25 09:25:29'),
(4233, 2026, '2026-08-06', 'พฤหัสบดี', 9, 24, NULL, 5, 8, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A8', '2025-12-25 09:25:29'),
(4234, 2026, '2026-08-07', 'ศุกร์', 1, 13, NULL, 7, 14, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: B4', '2025-12-25 09:25:29'),
(4235, 2026, '2026-08-08', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4236, 2026, '2026-08-09', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4237, 2026, '2026-08-10', 'จันทร์', 4, 17, NULL, 11, 21, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B11', '2025-12-25 09:25:29'),
(4238, 2026, '2026-08-11', 'อังคาร', 10, 16, NULL, 20, 23, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B13', '2025-12-25 09:25:29'),
(4239, 2026, '2026-08-12', 'พุธ', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันแม่แห่งชาติ', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4240, 2026, '2026-08-13', 'พฤหัสบดี', 6, 25, NULL, 24, 19, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B9', '2025-12-25 09:25:29'),
(4241, 2026, '2026-08-14', 'ศุกร์', 2, 14, NULL, 16, 13, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B3', '2025-12-25 09:25:29'),
(4242, 2026, '2026-08-15', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4243, 2026, '2026-08-16', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4244, 2026, '2026-08-17', 'จันทร์', 5, 15, NULL, 18, 25, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: B15', '2025-12-25 09:25:29'),
(4245, 2026, '2026-08-18', 'อังคาร', 3, 22, NULL, 12, 17, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B7', '2025-12-25 09:25:29'),
(4246, 2026, '2026-08-19', 'พุธ', 8, 19, NULL, 15, 6, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: A6', '2025-12-25 09:25:29'),
(4247, 2026, '2026-08-20', 'พฤหัสบดี', 7, 18, NULL, 22, 9, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: A9', '2025-12-25 09:25:29'),
(4248, 2026, '2026-08-21', 'ศุกร์', 1, 11, NULL, 2, 5, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: A5', '2025-12-25 09:25:29'),
(4249, 2026, '2026-08-22', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4250, 2026, '2026-08-23', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4251, 2026, '2026-08-24', 'จันทร์', 9, 12, NULL, 8, 7, 1, 0, 0, NULL, ' | เช้า: A8, บ่าย: A7', '2025-12-25 09:25:29'),
(4252, 2026, '2026-08-25', 'อังคาร', 2, 20, NULL, 1, 3, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: A3', '2025-12-25 09:25:29'),
(4253, 2026, '2026-08-26', 'พุธ', 4, 21, NULL, 11, 16, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B6', '2025-12-25 09:25:29'),
(4254, 2026, '2026-08-27', 'พฤหัสบดี', 10, 14, NULL, 13, 20, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B10', '2025-12-25 09:25:29'),
(4255, 2026, '2026-08-28', 'ศุกร์', 5, 23, NULL, 4, 21, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: B11', '2025-12-25 09:25:29'),
(4256, 2026, '2026-08-29', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4257, 2026, '2026-08-30', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4258, 2026, '2026-08-31', 'จันทร์', 6, 24, NULL, 10, 14, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: B4', '2025-12-25 09:25:29'),
(4259, 2026, '2026-09-01', 'อังคาร', 3, 25, NULL, 17, 12, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B2', '2025-12-25 09:25:29'),
(4260, 2026, '2026-09-02', 'พุธ', NULL, NULL, NULL, 19, 22, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B12', '2025-12-25 09:25:29'),
(4261, 2026, '2026-09-03', 'พฤหัสบดี', 8, 16, NULL, 25, 23, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B13', '2025-12-25 09:25:29'),
(4262, 2026, '2026-09-04', 'ศุกร์', NULL, NULL, NULL, 24, 15, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B5', '2025-12-25 09:25:29'),
(4263, 2026, '2026-09-05', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4264, 2026, '2026-09-06', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4265, 2026, '2026-09-07', 'จันทร์', 7, 13, NULL, 18, 4, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: A4', '2025-12-25 09:25:29'),
(4266, 2026, '2026-09-08', 'อังคาร', 9, 17, NULL, 2, 1, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: A1', '2025-12-25 09:25:29'),
(4267, 2026, '2026-09-09', 'พุธ', NULL, NULL, NULL, 7, 10, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: A10', '2025-12-25 09:25:29'),
(4268, 2026, '2026-09-10', 'พฤหัสบดี', 4, 15, NULL, 9, 6, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A6', '2025-12-25 09:25:29'),
(4269, 2026, '2026-09-11', 'ศุกร์', NULL, NULL, NULL, 5, 3, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A3', '2025-12-25 09:25:29'),
(4270, 2026, '2026-09-12', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4271, 2026, '2026-09-13', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4272, 2026, '2026-09-14', 'จันทร์', 1, 19, NULL, 8, 11, 1, 0, 0, NULL, ' | เช้า: A8, บ่าย: B1', '2025-12-25 09:25:29'),
(4273, 2026, '2026-09-15', 'อังคาร', 5, 22, NULL, 14, 25, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B15', '2025-12-25 09:25:29'),
(4274, 2026, '2026-09-16', 'พุธ', NULL, NULL, NULL, 20, 19, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B9', '2025-12-25 09:25:29'),
(4275, 2026, '2026-09-17', 'พฤหัสบดี', 2, 18, NULL, 21, 24, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B14', '2025-12-25 09:25:29'),
(4276, 2026, '2026-09-18', 'ศุกร์', NULL, NULL, NULL, 16, 13, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B3', '2025-12-25 09:25:29'),
(4277, 2026, '2026-09-19', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4278, 2026, '2026-09-20', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4279, 2026, '2026-09-21', 'จันทร์', 10, 11, NULL, 23, 22, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B12', '2025-12-25 09:25:29'),
(4280, 2026, '2026-09-22', 'อังคาร', 6, 21, NULL, 15, 12, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B2', '2025-12-25 09:25:29'),
(4281, 2026, '2026-09-23', 'พุธ', NULL, NULL, NULL, 17, 18, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B8', '2025-12-25 09:25:29'),
(4282, 2026, '2026-09-24', 'พฤหัสบดี', 3, 20, NULL, 9, 7, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A7', '2025-12-25 09:25:29'),
(4283, 2026, '2026-09-25', 'ศุกร์', NULL, NULL, NULL, 6, 2, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: A2', '2025-12-25 09:25:29'),
(4284, 2026, '2026-09-26', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4285, 2026, '2026-09-27', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4286, 2026, '2026-09-28', 'จันทร์', 8, 23, NULL, 3, 5, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: A5', '2025-12-25 09:25:29'),
(4287, 2026, '2026-09-29', 'อังคาร', 7, 24, NULL, 4, 1, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: A1', '2025-12-25 09:25:29'),
(4288, 2026, '2026-09-30', 'พุธ', NULL, NULL, NULL, 10, 8, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: A8', '2025-12-25 09:25:29'),
(4289, 2026, '2026-10-01', 'พฤหัสบดี', 9, 25, NULL, 14, 21, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B11', '2025-12-25 09:25:29'),
(4290, 2026, '2026-10-02', 'ศุกร์', NULL, NULL, NULL, 11, 20, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B10', '2025-12-25 09:25:29'),
(4291, 2026, '2026-10-03', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4292, 2026, '2026-10-04', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4293, 2026, '2026-10-05', 'จันทร์', 4, 14, NULL, 13, 16, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B6', '2025-12-25 09:25:29'),
(4294, 2026, '2026-10-06', 'อังคาร', 1, 12, NULL, 25, 15, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B5', '2025-12-25 09:25:29'),
(4295, 2026, '2026-10-07', 'พุธ', NULL, NULL, NULL, 22, 17, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B7', '2025-12-25 09:25:29'),
(4296, 2026, '2026-10-08', 'พฤหัสบดี', 5, 13, NULL, 19, 23, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B13', '2025-12-25 09:25:29'),
(4297, 2026, '2026-10-09', 'ศุกร์', NULL, NULL, NULL, 12, 24, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B14', '2025-12-25 09:25:29'),
(4298, 2026, '2026-10-10', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4299, 2026, '2026-10-11', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4300, 2026, '2026-10-12', 'จันทร์', 2, 16, NULL, 18, 9, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: A9', '2025-12-25 09:25:29'),
(4301, 2026, '2026-10-13', 'อังคาร', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันนวมินทรมหาราช', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4302, 2026, '2026-10-14', 'พุธ', NULL, NULL, NULL, 1, 4, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: A4', '2025-12-25 09:25:29'),
(4303, 2026, '2026-10-15', 'พฤหัสบดี', 6, 17, NULL, 7, 10, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: A10', '2025-12-25 09:25:29'),
(4304, 2026, '2026-10-16', 'ศุกร์', NULL, NULL, NULL, 2, 5, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: A5', '2025-12-25 09:25:29'),
(4305, 2026, '2026-10-17', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4306, 2026, '2026-10-18', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4307, 2026, '2026-10-19', 'จันทร์', 3, 19, NULL, 6, 14, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: B4', '2025-12-25 09:25:29'),
(4308, 2026, '2026-10-20', 'อังคาร', 8, 15, NULL, 21, 11, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B1', '2025-12-25 09:25:29'),
(4309, 2026, '2026-10-21', 'พุธ', NULL, NULL, NULL, 3, 25, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: B15', '2025-12-25 09:25:29'),
(4310, 2026, '2026-10-22', 'พฤหัสบดี', 10, 22, NULL, 8, 19, 1, 0, 0, NULL, ' | เช้า: A8, บ่าย: B9', '2025-12-25 09:25:29'),
(4311, 2026, '2026-10-23', 'ศุกร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันปิยมหาราช', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4312, 2026, '2026-10-24', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4313, 2026, '2026-10-25', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4314, 2026, '2026-10-26', 'จันทร์', 7, 18, NULL, 20, 13, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B3', '2025-12-25 09:25:29'),
(4315, 2026, '2026-10-27', 'อังคาร', 4, 11, NULL, 16, 22, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B12', '2025-12-25 09:25:29'),
(4316, 2026, '2026-10-28', 'พุธ', NULL, NULL, NULL, 23, 17, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B7', '2025-12-25 09:25:29'),
(4317, 2026, '2026-10-29', 'พฤหัสบดี', 1, 21, NULL, 24, 12, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B2', '2025-12-25 09:25:29'),
(4318, 2026, '2026-10-30', 'ศุกร์', NULL, NULL, NULL, 15, 18, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B8', '2025-12-25 09:25:29'),
(4319, 2026, '2026-10-31', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4320, 2026, '2026-11-01', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4321, 2026, '2026-11-02', 'จันทร์', 9, 20, NULL, 4, 6, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: A6', '2025-12-25 09:25:29'),
(4322, 2026, '2026-11-03', 'อังคาร', 10, 23, NULL, 5, 7, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A7', '2025-12-25 09:25:29'),
(4323, 2026, '2026-11-04', 'พุธ', NULL, NULL, NULL, 9, 3, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A3', '2025-12-25 09:25:29'),
(4324, 2026, '2026-11-05', 'พฤหัสบดี', 2, 24, NULL, 1, 8, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: A8', '2025-12-25 09:25:29'),
(4325, 2026, '2026-11-06', 'ศุกร์', NULL, NULL, NULL, 10, 14, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: B4', '2025-12-25 09:25:29'),
(4326, 2026, '2026-11-07', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4327, 2026, '2026-11-08', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4328, 2026, '2026-11-09', 'จันทร์', 6, 25, NULL, 2, 20, 1, 0, 0, NULL, ' | เช้า: A2, บ่าย: B10', '2025-12-25 09:25:29'),
(4329, 2026, '2026-11-10', 'อังคาร', 3, 13, NULL, 11, 21, 1, 0, 0, NULL, ' | เช้า: B1, บ่าย: B11', '2025-12-25 09:25:29'),
(4330, 2026, '2026-11-11', 'พุธ', NULL, NULL, NULL, 16, 25, 1, 0, 0, NULL, ' | เช้า: B6, บ่าย: B15', '2025-12-25 09:25:29'),
(4331, 2026, '2026-11-12', 'พฤหัสบดี', 5, 12, NULL, 13, 15, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B5', '2025-12-25 09:25:29'),
(4332, 2026, '2026-11-13', 'ศุกร์', NULL, NULL, NULL, 22, 23, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B13', '2025-12-25 09:25:29'),
(4333, 2026, '2026-11-14', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4334, 2026, '2026-11-15', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4335, 2026, '2026-11-16', 'จันทร์', 8, 17, NULL, 12, 19, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B9', '2025-12-25 09:25:29'),
(4336, 2026, '2026-11-17', 'อังคาร', 7, 14, NULL, 18, 24, 1, 0, 0, NULL, ' | เช้า: B8, บ่าย: B14', '2025-12-25 09:25:29'),
(4337, 2026, '2026-11-18', 'พุธ', NULL, NULL, NULL, 17, 2, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: A2', '2025-12-25 09:25:29'),
(4338, 2026, '2026-11-19', 'พฤหัสบดี', 4, 16, NULL, 3, 9, 1, 0, 0, NULL, ' | เช้า: A3, บ่าย: A9', '2025-12-25 09:25:29'),
(4339, 2026, '2026-11-20', 'ศุกร์', NULL, NULL, NULL, 7, 10, 1, 0, 0, NULL, ' | เช้า: A7, บ่าย: A10', '2025-12-25 09:25:29'),
(4340, 2026, '2026-11-21', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4341, 2026, '2026-11-22', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4342, 2026, '2026-11-23', 'จันทร์', 1, 19, NULL, 6, 4, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: A4', '2025-12-25 09:25:29'),
(4343, 2026, '2026-11-24', 'อังคาร', 9, 22, NULL, 5, 8, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: A8', '2025-12-25 09:25:29'),
(4344, 2026, '2026-11-25', 'พุธ', NULL, NULL, NULL, 1, 11, 1, 0, 0, NULL, ' | เช้า: A1, บ่าย: B1', '2025-12-25 09:25:29'),
(4345, 2026, '2026-11-26', 'พฤหัสบดี', 3, 15, NULL, 14, 16, 1, 0, 0, NULL, ' | เช้า: B4, บ่าย: B6', '2025-12-25 09:25:29'),
(4346, 2026, '2026-11-27', 'ศุกร์', NULL, NULL, NULL, 20, 21, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B11', '2025-12-25 09:25:29'),
(4347, 2026, '2026-11-28', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4348, 2026, '2026-11-29', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4349, 2026, '2026-11-30', 'จันทร์', 10, 18, NULL, 25, 13, 1, 0, 0, NULL, ' | เช้า: B15, บ่าย: B3', '2025-12-25 09:25:29'),
(4350, 2026, '2026-12-01', 'อังคาร', 2, 16, NULL, 23, 22, 1, 0, 0, NULL, ' | เช้า: B13, บ่าย: B12', '2025-12-25 09:25:29'),
(4351, 2026, '2026-12-02', 'พุธ', NULL, NULL, NULL, 19, 15, 1, 0, 0, NULL, ' | เช้า: B9, บ่าย: B5', '2025-12-25 09:25:29'),
(4352, 2026, '2026-12-03', 'พฤหัสบดี', 6, 11, NULL, 24, 17, 1, 0, 0, NULL, ' | เช้า: B14, บ่าย: B7', '2025-12-25 09:25:29'),
(4353, 2026, '2026-12-04', 'ศุกร์', NULL, NULL, NULL, 12, 18, 1, 0, 0, NULL, ' | เช้า: B2, บ่าย: B8', '2025-12-25 09:25:29'),
(4354, 2026, '2026-12-05', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4355, 2026, '2026-12-06', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4356, 2026, '2026-12-07', 'จันทร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันหยุดชดเชยวันพ่อ', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4357, 2026, '2026-12-08', 'อังคาร', 5, 19, NULL, 9, 1, 1, 0, 0, NULL, ' | เช้า: A9, บ่าย: A1', '2025-12-25 09:25:29'),
(4358, 2026, '2026-12-09', 'พุธ', NULL, NULL, NULL, 10, 2, 1, 0, 0, NULL, ' | เช้า: A10, บ่าย: A2', '2025-12-25 09:25:29'),
(4359, 2026, '2026-12-10', 'พฤหัสบดี', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันรัฐธรรมนูญ', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4360, 2026, '2026-12-11', 'ศุกร์', NULL, NULL, NULL, 4, 7, 1, 0, 0, NULL, ' | เช้า: A4, บ่าย: A7', '2025-12-25 09:25:29'),
(4361, 2026, '2026-12-12', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4362, 2026, '2026-12-13', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4363, 2026, '2026-12-14', 'จันทร์', 8, 21, NULL, 6, 3, 1, 0, 0, NULL, ' | เช้า: A6, บ่าย: A3', '2025-12-25 09:25:29'),
(4364, 2026, '2026-12-15', 'อังคาร', 7, 20, NULL, 5, 14, 1, 0, 0, NULL, ' | เช้า: A5, บ่าย: B4', '2025-12-25 09:25:29'),
(4365, 2026, '2026-12-16', 'พุธ', NULL, NULL, NULL, 8, 11, 1, 0, 0, NULL, ' | เช้า: A8, บ่าย: B1', '2025-12-25 09:25:29'),
(4366, 2026, '2026-12-17', 'พฤหัสบดี', 9, 23, NULL, 21, 16, 1, 0, 0, NULL, ' | เช้า: B11, บ่าย: B6', '2025-12-25 09:25:29'),
(4367, 2026, '2026-12-18', 'ศุกร์', NULL, NULL, NULL, 20, 25, 1, 0, 0, NULL, ' | เช้า: B10, บ่าย: B15', '2025-12-25 09:25:29'),
(4368, 2026, '2026-12-19', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4369, 2026, '2026-12-20', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4370, 2026, '2026-12-21', 'จันทร์', 4, 24, NULL, 17, 12, 1, 0, 0, NULL, ' | เช้า: B7, บ่าย: B2', '2025-12-25 09:25:29'),
(4371, 2026, '2026-12-22', 'อังคาร', 1, 25, NULL, 13, 19, 1, 0, 0, NULL, ' | เช้า: B3, บ่าย: B9', '2025-12-25 09:25:29'),
(4372, 2026, '2026-12-23', 'พุธ', NULL, NULL, NULL, 22, 23, 1, 0, 0, NULL, ' | เช้า: B12, บ่าย: B13', '2025-12-25 09:25:29'),
(4373, 2026, '2026-12-24', 'พฤหัสบดี', 10, 14, NULL, 15, 24, 1, 0, 0, NULL, ' | เช้า: B5, บ่าย: B14', '2025-12-25 09:25:29'),
(4374, 2026, '2026-12-25', 'ศุกร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 0, NULL, '(ไม่คาดคิด)', '2025-12-25 09:25:29'),
(4375, 2026, '2026-12-26', 'เสาร์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4376, 2026, '2026-12-27', 'อาทิตย์', NULL, NULL, NULL, NULL, NULL, 0, 1, 0, NULL, 'เสาร์-อาทิตย์ (ไม่จัดเวร)', '2025-12-25 09:25:29'),
(4377, 2026, '2026-12-28', 'จันทร์', NULL, NULL, NULL, NULL, NULL, 0, 0, 0, NULL, '(ไม่คาดคิด)', '2025-12-25 09:25:29'),
(4378, 2026, '2026-12-29', 'อังคาร', NULL, NULL, NULL, NULL, NULL, 0, 0, 0, NULL, '(ไม่คาดคิด)', '2025-12-25 09:25:29'),
(4379, 2026, '2026-12-30', 'พุธ', NULL, NULL, NULL, NULL, NULL, 0, 0, 0, NULL, '(ไม่คาดคิด)', '2025-12-25 09:25:29'),
(4380, 2026, '2026-12-31', 'พฤหัสบดี', NULL, NULL, NULL, NULL, NULL, 0, 0, 1, 'วันสิ้นปี', 'วันหยุดราชการ (ไม่จัดเวร)', '2025-12-25 09:25:29');

-- --------------------------------------------------------

--
-- Table structure for table `schedule_meta`
--

CREATE TABLE `schedule_meta` (
  `id` int(11) NOT NULL,
  `year` int(11) NOT NULL,
  `working_days_count` int(11) DEFAULT NULL,
  `rs_group_a_count` int(11) DEFAULT NULL,
  `rs_group_b_count` int(11) DEFAULT NULL,
  `generated_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `schedule_meta`
--

INSERT INTO `schedule_meta` (`id`, `year`, `working_days_count`, `rs_group_a_count`, `rs_group_b_count`, `generated_at`) VALUES
(12, 2026, 238, 156, 320, '2025-12-25 09:25:29');

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_uca1400_ai_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`setting_key`, `setting_value`) VALUES
('public_login_enabled', '0');

-- --------------------------------------------------------

--
-- Table structure for table `staff`
--

CREATE TABLE `staff` (
  `id` int(11) NOT NULL,
  `code` varchar(10) NOT NULL,
  `name` varchar(100) NOT NULL,
  `group_type` enum('A','B') NOT NULL,
  `active` tinyint(1) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `staff`
--

INSERT INTO `staff` (`id`, `code`, `name`, `group_type`, `active`, `created_at`, `updated_at`) VALUES
(1, 'A1', 'ศุภลักษณ์', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:25:42'),
(2, 'A2', 'ปัทมา', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:26:59'),
(3, 'A3', 'ทรงวุฒิ', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:28:03'),
(4, 'A4', 'ศิรนาถ', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:28:18'),
(5, 'A5', 'สิริพันธุ์', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:28:36'),
(6, 'A6', 'จุฑามาศ​(ก้อย)', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:36:37'),
(7, 'A7', 'จุฑาภัค', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:30:34'),
(8, 'A8', 'ปณิธาน', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:31:33'),
(9, 'A9', 'มนธณรรฐ', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:31:53'),
(10, 'A10', 'กนกกาญจน์', 'A', 1, '2025-12-10 12:08:22', '2025-12-23 07:32:12'),
(11, 'B1', 'จุฑามาศ(หนิง)', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:36:43'),
(12, 'B2', 'รชนิศ', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:37:33'),
(13, 'B3', 'สมาภรณ์', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:37:46'),
(14, 'B4', 'นิธิกร', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:38:06'),
(15, 'B5', 'อารีรัตน์', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:38:24'),
(16, 'B6', 'รัชญา', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:38:36'),
(17, 'B7', 'ไตรรัตนา', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:38:50'),
(18, 'B8', 'ปรียากร', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:39:03'),
(19, 'B9', 'กนกพรรณพร', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:39:17'),
(20, 'B10', 'เทพฤทธิ์', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:39:30'),
(21, 'B11', 'ธรณ์ดาณี', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:39:45'),
(22, 'B12', 'ศศิประภา', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:40:00'),
(23, 'B13', 'สันติ', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:40:12'),
(24, 'B14', 'ปริศนา', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:40:25'),
(25, 'B15', 'สริญา', 'B', 1, '2025-12-10 12:08:22', '2025-12-23 07:40:39');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(20) NOT NULL DEFAULT 'admin',
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `role`, `created_at`) VALUES
(1, 'admin', '$2y$10$MKy8tS5spOYsQLnOWxo5POwiPgX4xv6P.0MmxEUkPNgezHNNrYqd6', 'admin', '2025-12-10 12:02:09');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `schedules`
--
ALTER TABLE `schedules`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_year_date` (`year`,`date`),
  ADD KEY `tp_a_id` (`tp_a_id`),
  ADD KEY `tp_b_id` (`tp_b_id`),
  ADD KEY `rs_id` (`rs_id`),
  ADD KEY `idx_date` (`date`),
  ADD KEY `idx_year` (`year`),
  ADD KEY `fk_rs_morning` (`rs_morning_id`),
  ADD KEY `fk_rs_afternoon` (`rs_afternoon_id`);

--
-- Indexes for table `schedule_meta`
--
ALTER TABLE `schedule_meta`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `year` (`year`),
  ADD KEY `idx_year` (`year`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`setting_key`);

--
-- Indexes for table `staff`
--
ALTER TABLE `staff`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`),
  ADD KEY `idx_code` (`code`),
  ADD KEY `idx_group` (`group_type`),
  ADD KEY `idx_active` (`active`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD KEY `idx_username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `schedules`
--
ALTER TABLE `schedules`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4381;

--
-- AUTO_INCREMENT for table `schedule_meta`
--
ALTER TABLE `schedule_meta`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `staff`
--
ALTER TABLE `staff`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `schedules`
--
ALTER TABLE `schedules`
  ADD CONSTRAINT `fk_rs_afternoon` FOREIGN KEY (`rs_afternoon_id`) REFERENCES `staff` (`id`),
  ADD CONSTRAINT `fk_rs_morning` FOREIGN KEY (`rs_morning_id`) REFERENCES `staff` (`id`),
  ADD CONSTRAINT `schedules_ibfk_1` FOREIGN KEY (`tp_a_id`) REFERENCES `staff` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `schedules_ibfk_2` FOREIGN KEY (`tp_b_id`) REFERENCES `staff` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `schedules_ibfk_3` FOREIGN KEY (`rs_id`) REFERENCES `staff` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
